create table GradeRange(            #江苏省高考分数排名表
    grade int,                      #成绩
    srange int                      #排名
);
create table User(                  #用户表
    id varchar(10) primary key,     #用户id
    grade int,                      #用户成绩  
    passwords varchar(10),          #密码
    Major varchar(10),              #意向专业
    notes varchar(50)               #备注
);
create table School(
    SchoolNum varchar(10) primary key,          #院校编号
    SchoolName varchar(10),                     #名称
)
create table SchoolRangeCS(         #计算机院校排名表
    SchoolNum varchar(10),          #院校编号
    SchoolRange int,                #排名
    Major varchar(10),              #专业
    primary key(SchoolNum,Major)
);
create table SchoolRangeES(         #电信院校排名表
    SchoolNum varchar(10),          #院校编号
    SchoolRange int,                #排名
    Major varchar(10),              #专业
    primary key(SchoolNum,Major)
);
create table HistorySchoolDataCS(   #计算机院校历史录取数据表
    id varchar(10),                 #历史用户id
    srange int,                     #用户排名
    HSrange int,                    #用户最高排名
    LSrange int,                    #用户最低排名
    Syear int,                      #年份        根据年份继续分表
    SchoolNum int,                  #院校编码
    SchoolName varchar(10),         #院校名称
    Major varchar(10),              #专业
    primary key(id,SchoolNum),
    foreign key(id) references User(id),
    foreign key(SchoolNum) references SchoolRange(SchoolNum)
);
create table HistorySchoolDataES(   #电信院校历史录取数据表
    id varchar(10),                 #历史用户id
    srange int,                     #用户排名
    HSrange int,                    #用户最高排名
    LSrange int,                    #用户最低排名
    Syear int,                      #年份
    SchoolNum int,                  #院校编码
    SchoolName varchar(10),         #院校名称
    Major varchar(10),              #专业
    primary key(id,SchoolNum),
    foreign key(id) references User(id),
    foreign key(SchoolNum) references SchoolRange(SchoolNum)
);



Insert into GradeRange(grade,srange) values (715,1),(713,2),(709,3),(707,4),(703,5),(694,6),(693,7),(690,8),(689,9),(688,10),(686,11),(684,12),(671,13),(669,14),(668,15),(668,16),(667,17),(666,18),(666,19),(663,20),(659,21),(652,22),(643,23),(639,24),(634,25),(634,26),(627,27),(625,28),(623,29),(621,30),(618,31),(616,32),(614,33),(610,34),(606,35),(599,36),(595,37),(594,38),(592,39),(591,40),(589,41),(589,42),(578,43),(578,44),(573,45),(572,46),(571,47),(558,48),(558,49),(556,50),(551,51),(545,52),(540,53),(538,54),(533,55),(532,56),(531,57),(530,58),(514,59),(513,60),(512,61),(510,62),(510,63),(509,64),(509,65),(499,66),(492,67),(492,68),(485,69),(480,70),(480,71),(476,72),(476,73),(471,74),(469,75),(465,76),(461,77),(461,78),(450,79),(448,80),(448,81),(446,82),(444,83),(443,84),(442,85),(442,86),(433,87),(433,88),(430,89),(428,90),(425,91),(422,92),(416,93),(409,94),(406,95),(399,96),(397,97),(395,98),(389,99),(382,100),(379,101),(374,102),(373,103),(373,104),(371,105),(370,106),(370,107),(370,108),(346,109),(346,110),(344,111),(335,112),(333,113),(332,114),(327,115),(324,116),(322,117),(316,118),(313,119),(313,120),(312,121),(306,122),(304,123),(299,124),(293,125),(290,126),(286,127),(286,128),(281,129),(277,130),(273,131),(270,132),(262,133),(258,134),(258,135),(257,136),(253,137),(250,138),(249,139),(248,140),(239,141),(235,142),(231,143),(228,144),(226,145),(226,146),(208,147),(208,148),(203,149),(203,150),(189,151),(188,152),(185,153),(180,154),(178,155),(174,156),(173,157),(173,158),(171,159),(169,160),(169,161),(167,162),(163,163),(163,164),(160,165),(159,166),(159,167),(156,168),(152,169),(148,170),(145,171),(140,172),(134,173),(131,174),(128,175),(128,176),(125,177),(121,178),(118,179),(118,180),(117,181),(115,182),(106,183),(105,184),(105,185),(103,186),(100,187),(93,188),(92,189),(89,190),(85,191),(84,192),(81,193),(74,194),(71,195),(65,196),(56,197),(53,198),(52,199),(50,200)

Insert into SchoolRange(SchoolNum,SchoolName,SchoolRange,Major) values (js01,'南京大学',1,'计算机科学与技术'),(js02,'东南大学',2,'计算机科学与技术'),(js03,'江南大学',3,'计算机科学与技术'),(js04,'河海大学',4,'计算机科学与技术'),(js05,'南京工业大学',5,'计算机科学与技术'),(js06,'南京信息工程大学',6,'计算机科学与技术'),(js07,'南京邮电大学',7,'计算机科学与技术'),(js08,'苏州大学',8,'计算机科学与技术'),(js09,'南京航空航天大学',9,'计算机科学与技术'),(js10,'南京理工大学',10,'计算机科学与技术'),(js11,'南京农业大学',11,'计算机科学与技术'),(js12,'南京医科大学',12,'计算机科学与技术'),(js13,'南京师范大学',13,'计算机科学与技术'),(js14,'中国矿业大学',14,'计算机科学与技术'),(js15,'西交利物浦大学',15,'计算机科学与技术'),(js16,'江苏大学',16,'计算机科学与技术'),(js17,'扬州大学',17,'计算机科学与技术'),(js18,'江苏师范大学',18,'计算机科学与技术'),(js19,'徐州医科大学',19,'计算机科学与技术'),(js20,'南京林业大学',20,'计算机科学与技术'),(js21,'南京中医药大学',21,'计算机科学与技术'),(js22,'南通大学',22,'计算机科学与技术'),(js23,'南京财经大学',23,'计算机科学与技术'),(js24,'常州大学',24,'计算机科学与技术'),(js25,'江苏科技大学',25,'计算机科学与技术'),(js26,'南京审计大学',26,'计算机科学与技术'),(js27,'苏州科技大学',27,'计算机科学与技术'),(js28,'南京工程学院',28,'计算机科学与技术'),(js29,'淮阴师范学院',29,'计算机科学与技术'),(js30,'江苏理工学院',30,'计算机科学与技术'),(js31,'南京晓庄学院',31,'计算机科学与技术'),(js32,'江苏海洋大学',32,'计算机科学与技术'),(js33,'盐城师范学院',33,'计算机科学与技术'),(js34,'常熟理工学院',34,'计算机科学与技术'),(js35,'淮阴工学院',35,'计算机科学与技术'),(js36,'常州学院',36,'计算机科学与技术'),(js37,'江苏第二师范学院',37,'计算机科学与技术'),(js38,'徐州工程学院学院',38,'计算机科学与技术'),(js39,'泰州学院',39,'计算机科学与技术'),(js40,'南京特殊教育师范学院',40,'计算机科学与技术'),(js41,'江苏警官学院',41,'计算机科学与技术'),(js42,'南京大学金陵学院',42,'计算机科学与技术'),(js43,'江苏城市职业学院',43,'计算机科学与技术'),(js44,'东南大学成贤学院',44,'计算机科学与技术'),(js45,'无锡太湖学院学院',45,'计算机科学与技术'),(js46,'南京师范大学泰州学院',46,'计算机科学与技术'),(js47,'南通理工学院',47,'计算机科学与技术'),(js48,'江苏大学京江学院',48,'计算机科学与技术'),(js49,'南京理工大学泰州科技学院',49,'计算机科学与技术'),(js50,'南京邮电大学通达学院',50,'计算机科学与技术'),(js51,'扬州大学广陵学院学院',51,'计算机科学与技术'),(js52,'南京师范大学中北学院',52,'计算机科学与技术'),(js53,'南京工业大学浦江学院',53,'计算机科学与技术'),(js54,'南京医科大学康达学院',54,'计算机科学与技术'),(js55,'南通大学杏林学院',55,'计算机科学与技术'),(js56,'无锡学院',56,'计算机科学与技术'),(js57,'江苏科技大学苏州理工学院',57,'计算机科学与技术'),(js58,'无锡商业职业技术学院',58,'计算机科学与技术'),(js59,'中国人民解放军陆军工程学院',59,'计算机科学与技术'),(js60,'泰州职业技术学院',60,'计算机科学与技术'),(js61,'无锡科技职业学院',61,'计算机科学与技术'),(js62,'苏州科技大学天平学院',62,'计算机科学与技术'),(js63,'江阴职业技术学院',63,'计算机科学与技术'),(js64,'扬州环境资源职业技术学院',64,'计算机科学与技术'),(js65,'三江学院',65,'计算机科学与技术'),(js66,'苏州城市学院',66,'计算机科学与技术'),(js67,'中国矿业大学徐海学院',67,'计算机科学与技术'),(js68,'南京航空航天大学金城学院',68,'计算机科学与技术'),(js69,'常州大学怀德学院',69,'计算机科学与技术'),(js70,'南京传媒学院',70,'计算机科学与技术'),(js71,'南京理工大学紫金学院',71,'计算机科学与技术'),(js72,'宿迁学院',72,'计算机科学与技术'),(js73,'江苏师范大学科文学院',73,'计算机科学与技术'),(js74,'苏州工艺美术职业技术学院',74,'计算机科学与技术'),(js75,'南京审计大学金审学院',75,'计算机科学与技术'),(js76,'苏州大学应用技术学院',76,'计算机科学与技术'),(js77,'徐州幼儿师范高等专科学院',77,'计算机科学与技术');

Insert into SchoolRange(SchoolNum,SchoolName,SchoolRange,Major) values (js02,'东南大学',1,'电子信息科学与技术'),(js07,'南京邮电大学',2,'电子信息科学与技术'),(js10,'南京理工大学',3,'电子信息科学与技术'),(js01,'南京大学',4,'电子信息科学与技术'),(js08,'苏州大学',5,'电子信息科学与技术'),(js12,'南京医科大学',6,'电子信息科学与技术'),(js04,'河海大学',7,'电子信息科学与技术'),(js15,'西交利物浦大学',8,'电子信息科学与技术'),(js06,'南京信息工程大学',9,'电子信息科学与技术'),(js22,'南通大学',10,'电子信息科学与技术'),(js24,'常州大学',11,'电子信息科学与技术'),(js32,'江苏海洋大学',12,'电子信息科学与技术'),(js34,'常熟理工学院',13,'电子信息科学与技术'),(js78,'盐城工学院',14,'电子信息科学与技术'),(js35,'淮阴工学院',15,'电子信息科学与技术'),(js79,'常州工学院',16,'电子信息科学与技术'),(js38,'徐州工程学院',17,'电子信息科学与技术'),(js44,'东南大学成贤学院',18,'电子信息科学与技术'),(js50,'南京邮电大学通达学院',19,'电子信息科学与技术'),(js56,'无锡学院',20,'电子信息科学与技术'),(js60,'泰州职业技术学院',21,'电子信息科学与技术'),(js69,'常州大学怀德学院',22,'电子信息科学与技术'),(js65,'三江学院',23,'电子信息科学与技术'),(js66,'苏州城市学院',24,'电子信息科学与技术'),(js71,'南京理工大学紫金学院',25,'电子信息科学与技术'),(js67,'中国矿业大学徐海学院',26,'电子信息科学与技术'),(js68,'南京航空航天大学金城学院',27,'电子信息科学与技术');